tap "issakuss/papnt"
brew "act"
brew "anyenv"
brew "aom"
brew "openssl@3"
brew "glib"
brew "cairo"
brew "certifi"
brew "pycparser"
brew "cffi"
brew "cmake"
brew "codex"
brew "gnutls"
brew "harfbuzz"
brew "leptonica"
brew "libass"
brew "libmicrohttpd"
brew "pango"
brew "tesseract"
brew "ffmpeg"
brew "flyctl"
brew "gcc"
brew "gdk-pixbuf"
brew "ghostscript"
brew "git"
brew "node"
brew "gitmoji"
brew "netpbm"
brew "librsvg"
brew "graphviz"
brew "gsl"
brew "libheif"
brew "libraw"
brew "imagemagick"
brew "keyring"
brew "llvm"
brew "mecab"
brew "mecab-ipadic"
brew "mpich"
brew "nginx"
brew "oh-my-posh", link: false
brew "openjdk"
brew "openvino"
brew "php"
brew "poetry"
brew "poppler"
brew "pre-commit"
brew "pyenv"
brew "python@3.10"
brew "python@3.11"
brew "python@3.12"
brew "r"
brew "rust"
brew "shellcheck"
brew "tectonic"
brew "texlive"
brew "tree"
brew "virtualenv"
brew "volta"
brew "wget"
brew "xdg-ninja"
brew "yq"
brew "zsh-completions"
cask "docker-desktop"
cask "font-hack-nerd-font"
cask "gcloud-cli"
cask "mactex"
cask "ngrok"
cask "rstudio"
vscode "42crunch.vscode-openapi"
vscode "adam-bender.commit-message-editor"
vscode "affenwiesel.matlab-formatter"
vscode "amazonwebservices.aws-toolkit-vscode"
vscode "apommel.matlab-interactive-terminal"
vscode "bat67.matlab-extension-pack"
vscode "bramvanbilsen.matlab-code-run"
vscode "charliermarsh.ruff"
vscode "ckolkman.vscode-postgres"
vscode "cschlosser.doxdocgen"
vscode "dbaeumer.vscode-eslint"
vscode "docker.docker"
vscode "donjayamanne.githistory"
vscode "dsznajder.es7-react-js-snippets"
vscode "eamodio.gitlens"
vscode "esbenp.prettier-vscode"
vscode "formulahendry.auto-close-tag"
vscode "formulahendry.auto-rename-tag"
vscode "formulahendry.vscode-mysql"
vscode "genieai.chatgpt-vscode"
vscode "gimly81.matlab"
vscode "github.copilot"
vscode "github.copilot-chat"
vscode "github.github-vscode-theme"
vscode "github.vscode-github-actions"
vscode "github.vscode-pull-request-github"
vscode "golang.go"
vscode "grapecity.gc-excelviewer"
vscode "gruntfuggly.todo-tree"
vscode "hediet.vscode-drawio"
vscode "iamhyc.overleaf-workshop"
vscode "ibm.output-colorizer"
vscode "illixion.vscode-vibrancy-continued"
vscode "ionutvmi.path-autocomplete"
vscode "james-yu.latex-workshop"
vscode "janisdd.vscode-edit-csv"
vscode "jebbs.plantuml"
vscode "jeff-hykin.better-cpp-syntax"
vscode "leafvmaple.verilog"
vscode "mathworks.language-matlab"
vscode "mechatroner.rainbow-csv"
vscode "mhutchie.git-graph"
vscode "mkvoya.eps-preview"
vscode "mrmlnc.vscode-duplicate"
vscode "ms-azuretools.vscode-containers"
vscode "ms-azuretools.vscode-docker"
vscode "ms-ceintl.vscode-language-pack-ja"
vscode "ms-python.debugpy"
vscode "ms-python.mypy-type-checker"
vscode "ms-python.pylint"
vscode "ms-python.python"
vscode "ms-python.vscode-pylance"
vscode "ms-python.vscode-python-envs"
vscode "ms-toolsai.jupyter"
vscode "ms-toolsai.jupyter-keymap"
vscode "ms-toolsai.jupyter-renderers"
vscode "ms-toolsai.vscode-jupyter-cell-tags"
vscode "ms-toolsai.vscode-jupyter-powertoys"
vscode "ms-toolsai.vscode-jupyter-slideshow"
vscode "ms-vscode-remote.remote-containers"
vscode "ms-vscode-remote.remote-ssh"
vscode "ms-vscode-remote.remote-ssh-edit"
vscode "ms-vscode-remote.remote-wsl"
vscode "ms-vscode.cmake-tools"
vscode "ms-vscode.cpptools"
vscode "ms-vscode.cpptools-extension-pack"
vscode "ms-vscode.cpptools-themes"
vscode "ms-vscode.remote-explorer"
vscode "ms-vsliveshare.vsliveshare"
vscode "nicohlr.pycharm"
vscode "njpwerner.autodocstring"
vscode "octref.vetur"
vscode "oderwat.indent-rainbow"
vscode "openai.chatgpt"
vscode "pkief.material-icon-theme"
vscode "redhat.java"
vscode "redhat.vscode-yaml"
vscode "reditorsupport.r"
vscode "reditorsupport.r-syntax"
vscode "ritwickdey.liveserver"
vscode "seatonjiang.gitmoji-vscode"
vscode "shardulm94.trailing-spaces"
vscode "shopify.ruby-lsp"
vscode "slaier.matlab-complete"
vscode "soerenuhrbach.vscode-deepl"
vscode "streetsidesoftware.code-spell-checker"
vscode "tecosaur.latex-utilities"
vscode "tomoki1207.pdf"
vscode "twxs.cmake"
vscode "usernamehw.errorlens"
vscode "vincaslt.highlight-matching-tag"
vscode "visualstudioexptteam.intellicode-api-usage-examples"
vscode "visualstudioexptteam.vscodeintellicode"
vscode "vscjava.vscode-gradle"
vscode "vscjava.vscode-java-debug"
vscode "vscjava.vscode-java-dependency"
vscode "vscjava.vscode-java-pack"
vscode "vscjava.vscode-java-test"
vscode "vscjava.vscode-maven"
vscode "vscode-icons-team.vscode-icons"
vscode "wakatime.vscode-wakatime"
vscode "wscats.cors-browser"
vscode "yandeu.five-server"
vscode "yzane.markdown-pdf"
vscode "yzhang.markdown-all-in-one"
vscode "zxh404.vscode-proto3"
